[
  {
    "description": "",
    "content": "我叫陈皓，我以前的blog在CSDN——http://blog.csdn.net/haoel，08、09年的时候，CSDN的博客系统很不稳定，另外，正好有一台N年前的托管的服务器，所以，就申请了域名，自己建立自己的Blog。\n\n本站为什么叫“酷壳”，绝属误打误撞。原来的域名是：CoCre.com，原意是Corporation+Creative两个单词的缩写，是我一大学同学申请的，后来他出国了，所以，我就把这个域名用来做成我的Blog了，把CoCre按发音读成“酷壳”和“酷客”，但感觉不好记，于是注册了CoolShell.cn，感觉这个可能更好记一点。要说“酷壳”有什么意思，在这里我可以说，完全没有，就是一个名字罢了。\n\n这是一个完全依靠个人建立的技术性BLOG。是一个分享技术见闻，知识，趋势的网站，这是我个人建立的网站，如果你喜欢其中的文章呢，欢迎给我们留言，如果不想留言呢，你也可以通过打分来鼓励我们分享和写作。当然，我们最欢迎的是你的加入，欢迎你和我们一起写作。欢迎大家注册并加入我们一起来分享编程和技术方面的见闻和心得。文章可以是原创，翻译、杂谈，灌水，只要是和技术和编程相关就可以。\n\n![微信公众号](https://coolshell.cn/wp-\ncontent/uploads/2009/04/qrcode_for_gh_dd9d8c843f20_860-300x300.jpg) 微信公众号\n\n**除非文章内特别说明，你可以转载酷壳的文章，但请加入文章作者和出处。谢谢。**\n\n目前，为本站的贡献文章的相关人员如下，同时，也非常欢迎您的加入！\n\n目前，本站的文章绝大多数都是由我一个人发布，有人问我怎么这么能写，其实，10年前，我就有了每天都要花1-3个小时上网阅读的习惯，后来发现国内的资料不能满足我，于是就开始到国外阅读，尤其是Web2.0时代，使用RSS可以订阅很多Blog源。有时候，读到一些有意思的文章，我会记个笔记，或是写点心得，后来一想，反正习惯了，就写成blog吧。于是就有了这个网站。\n\n我希望通过共享知识能够和更多的人交流，大多数时候，这个站点主要是以分享一些见闻，知识，技术，心得，趣闻，等等，反正是个大杂烩，对于文章的内容，质量，风格基本上没有什么要求，主要是在一种轻松的氛围下享受编程和技术其中的点点滴滴就可以了。",
    "date": "",
    "title": "关于酷壳 | 酷 壳 - CoolShell",
    "url": "https://coolshell.cn/about"
  },
  {
    "description": "",
    "content": "![陈皓的照片](https://coolshell.cn/wp-content/uploads/2011/03/me.jpg)大家好，我是 **陈皓**\n，网名 **左耳朵耗子**\n（很多人问我为什么要叫这个“一只耳”的名字，你们猜），对了，我真的不是高手，我也不是牛人，离他们的距离还很大。我从2003年开始在网上记录一些自己的技术知识和想法，今天我还在努力学习希望能成长一个高手，因为，面对生活在今天这样技术日新月异的时代，我们每个人都是一个新人。\n\n我很幸运出生在这个时代——第三次工业革命的时代，也很幸运选对了专业，所以，可以算是一只“风口上的猪”了，就是运气好，赶上了这个好的时代，我要唯一要做的就是不要辜负这个时代，无它。\n\n我以前的博客在CSDN（http://blog.csdn.net/haoel），目前已不更新，博客全面转到酷壳：http://CoolShell.cn，我基本不会在微信公众号上写文章。\n\n#### 网络信息\n\n * **MSN/Emai** l： haoel(at)hotmail.com \n（MSN不常上，每天都收邮件）\n\n芝兰生于深谷，不以无人而不芳 \n君子修身养德，不以穷困而改志\n\n#### 个人简介\n\n20年软件开发相关工作经验，10年以上项目和团队管理经验。擅长底层技术架构，团队建设，软件工程，软件研发咨询，以及全球软件团队协作管理。对高性能，高可用性，分布式，高并发，以及大规模数据处理系统有一些经验和心得。喜欢关注底层技术平台和互联网行业应用。技术擅长C/C++/Java和Unix/Linux/Windows。曾于Amazon中国任研发经理，负责电子商务全球化业务（全球开店）和全球库存预测系统的研发。曾在阿里巴巴北京研发中心、商家业务部曾任资深专家一职，负责电商云平台、开放平台，云监控和电商多媒体平台。曾在阿里巴巴核心系统专家组从事阿里核心系统和阿里云ECS相关的虚拟化平台的开发工作。现在创业中，MegaEase创始人，致力于为企业的高并发高可用架构提供一整套的技术解决方案和产品\n\n#### 痛恨手册\n\n下面这个是我个人的“痛恨手册”，这足以证明，这是一个愚蠢的时代。\n\n * 痛恨各种不从研发团队出发，不从团队和项目出发的流程、方法论、咨询师、SQA、流程部门。 \n * 痛恨那些为所欲为的，为了自己商业目标牺牲用户利益的中国IT企业。 \n * 痛恨中国的C2C式的那种简单的抄袭和复制。\n * 痛恨互联网上的那个墙，还有那些烦得不能再烦的审查机制。（我能拥有.cn域名真是一种壮举） \n * 痛恨中国的某些编辑和某些作者乱出书，出烂书。\n\n另外，我在至少45岁前不会出书，因为我觉得在那之前，我是不会沉淀足够的学识，没有资格出书。所以， **请各种出版社的编辑们不要再来找我商谈出书的事**\n。与其花精力来找我谈出书，不如想想怎么少出那么多的烂书。",
    "date": "",
    "title": "关于陈皓 | 酷 壳 - CoolShell",
    "url": "https://coolshell.cn/haoel"
  }
]
